[Killed] BlockStatement
src/calculadora.ts:4:47
 export default class Calculadora {
     constructor() {}
 
-    public soma(a: number, b: number): number {
-        return a + b;
-    }
+    public soma(a: number, b: number): number {}
 
     public subtrair(a: number, b: number): number {
killedBy: classe Matematica Somar dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: undefined

[Killed] ArithmeticOperator
src/calculadora.ts:5:16
     constructor() {}
 
     public soma(a: number, b: number): number {
-        return a + b;
+        return a - b;
     }
 
killedBy: classe Matematica Somar dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 8

[Killed] BlockStatement
src/calculadora.ts:8:51
         return a + b;
     }
 
-    public subtrair(a: number, b: number): number {
-        return a - b;
-    }
+    public subtrair(a: number, b: number): number {}
 
     public multiplicar(a: number, b: number): number {
killedBy: classe Matematica Subtrair dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: undefined

[Killed] ArithmeticOperator
src/calculadora.ts:9:16
     }
 
     public subtrair(a: number, b: number): number {
-        return a - b;
+        return a + b;
     }
 
killedBy: classe Matematica Subtrair dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 12

[Killed] BlockStatement
src/calculadora.ts:12:54
         return a - b;
     }
 
-    public multiplicar(a: number, b: number): number {
-        return a * b;
-    }
+    public multiplicar(a: number, b: number): number {}
 
     public dividir(a: number, b: number): number {
killedBy: classe Matematica Multiplicar dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: undefined

[Killed] ArithmeticOperator
src/calculadora.ts:13:16
     }
 
     public multiplicar(a: number, b: number): number {
-        return a * b;
+        return a / b;
     }
 
killedBy: classe Matematica Multiplicar dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 5

[Killed] BlockStatement
src/calculadora.ts:16:50
         return a * b;
     }
 
-    public dividir(a: number, b: number): number {
-        try {
-            return a / b;
-        } catch (error) {  
-            throw new Error;
-        }
-    }
+    public dividir(a: number, b: number): number {}
 
     public potenciar(base: number, expoente: number): number {
killedBy: classe Matematica Dividir dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] BlockStatement
src/calculadora.ts:17:13
     }
 
     public dividir(a: number, b: number): number {
-        try {
-            return a / b;
-        } catch (error) {  
+        try {} catch (error) {  
             throw new Error;
         }
killedBy: classe Matematica Dividir dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ArithmeticOperator
src/calculadora.ts:18:20
 
     public dividir(a: number, b: number): number {
         try {
-            return a / b;
+            return a * b;
         } catch (error) {  
             throw new Error;
killedBy: classe Matematica Dividir dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 20

[Survived] BlockStatement
src/calculadora.ts:19:25
     public dividir(a: number, b: number): number {
         try {
             return a / b;
-        } catch (error) {  
-            throw new Error;
-        }
+        } catch (error) {}
     }
 

[Killed] BlockStatement
src/calculadora.ts:24:62
         }
     }
 
-    public potenciar(base: number, expoente: number): number {
-        return Math.pow(base, expoente);
-    }
+    public potenciar(base: number, expoente: number): number {}
 
     public radiciar(radicando: number, indice: number): number {
killedBy: classe Matematica Potenciar um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: undefined

[Killed] BlockStatement
src/calculadora.ts:28:64
         return Math.pow(base, expoente);
     }
 
-    public radiciar(radicando: number, indice: number): number {
-        if (indice === 0) {
-            throw new Error("Índice da raiz não pode ser zero");
-        }
-        if (radicando < 0 && indice % 2 === 0) {
-            throw new Error("Raiz par de número negativo não é permitida");
-        }
-        return Math.pow(radicando, 1 / indice);
-    }
+    public radiciar(radicando: number, indice: number): number {}
 }
 
killedBy: classe Matematica Radiciar um número com índice ímpar
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] BlockStatement
src/calculadora.ts:29:27
     }
 
     public radiciar(radicando: number, indice: number): number {
-        if (indice === 0) {
-            throw new Error("Índice da raiz não pode ser zero");
-        }
+        if (indice === 0) {}
         if (radicando < 0 && indice % 2 === 0) {
             throw new Error("Raiz par de número negativo não é permitida");
killedBy: classe Matematica Erro ao radiciar com índice zero
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Índice da raiz não pode ser zero"

Received function did not throw

[Killed] EqualityOperator
src/calculadora.ts:29:13
     }
 
     public radiciar(radicando: number, indice: number): number {
-        if (indice === 0) {
+        if (indice !== 0) {
             throw new Error("Índice da raiz não pode ser zero");
         }
killedBy: classe Matematica Radiciar um número com índice ímpar
statusReason: Error: Índice da raiz não pode ser zero

[Killed] StringLiteral
src/calculadora.ts:30:29
 
     public radiciar(radicando: number, indice: number): number {
         if (indice === 0) {
-            throw new Error("Índice da raiz não pode ser zero");
+            throw new Error("");
         }
         if (radicando < 0 && indice % 2 === 0) {
killedBy: classe Matematica Erro ao radiciar com índice zero
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Índice da raiz não pode ser zero"
Received message:   ""

      112 |         } else {
      113 |           stryCov_9fa48("44");
    > 114 |           throw new Error(stryMutAct_9fa48("45") ? "" : (stryCov_9fa48("45"), "Índice da raiz não pode ser zero"));

[Killed] ArithmeticOperator
src/calculadora.ts:32:30
         if (indice === 0) {
             throw new Error("Índice da raiz não pode ser zero");
         }
-        if (radicando < 0 && indice % 2 === 0) {
+        if (radicando < 0 && indice * 2 === 0) {
             throw new Error("Raiz par de número negativo não é permitida");
         }
killedBy: classe Matematica Erro ao radiciar número negativo com índice par
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Raiz par de número negativo não é permitida"

Received function did not throw

[Killed] ConditionalExpression
src/calculadora.ts:32:13
         if (indice === 0) {
             throw new Error("Índice da raiz não pode ser zero");
         }
-        if (radicando < 0 && indice % 2 === 0) {
+        if (false) {
             throw new Error("Raiz par de número negativo não é permitida");
         }
killedBy: classe Matematica Erro ao radiciar número negativo com índice par
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Raiz par de número negativo não é permitida"

Received function did not throw

[Killed] StringLiteral
src/calculadora.ts:33:29
             throw new Error("Índice da raiz não pode ser zero");
         }
         if (radicando < 0 && indice % 2 === 0) {
-            throw new Error("Raiz par de número negativo não é permitida");
+            throw new Error("");
         }
         return Math.pow(radicando, 1 / indice);
killedBy: classe Matematica Erro ao radiciar número negativo com índice par
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Raiz par de número negativo não é permitida"
Received message:   ""

      120 |         } else {
      121 |           stryCov_9fa48("55");
    > 122 |           throw new Error(stryMutAct_9fa48("56") ? "" : (stryCov_9fa48("56"), "Raiz par de número negativo não é permitida"));

[Killed] ArithmeticOperator
src/calculadora.ts:35:36
         if (radicando < 0 && indice % 2 === 0) {
             throw new Error("Raiz par de número negativo não é permitida");
         }
-        return Math.pow(radicando, 1 / indice);
+        return Math.pow(radicando, 1 * indice);
     }
 }
killedBy: classe Matematica Radiciar um número com índice ímpar
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 3
Received: 19683

Expected precision:    2
Expected difference: < 0.005
Received difference:   19680
