[Killed] BlockStatement
src/lista_numerica.ts:4:34
 export class ListaNumerica {
   private numeros: number[];
 
-  constructor(numeros: number[]) {
-    this.numeros = numeros;
-  }
+  constructor(numeros: number[]) {}
 
   getNumeros(): number[] {
killedBy: ListaNumerica deve retornar a lista de números corretamente
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3]
Received: undefined

[Killed] BlockStatement
src/lista_numerica.ts:8:26
     this.numeros = numeros;
   }
 
-  getNumeros(): number[] {
-    return this.numeros;
-  }
+  getNumeros(): number[] {}
 
   getQuantidade(): number {
killedBy: ListaNumerica deve retornar a lista de números corretamente
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3]
Received: undefined

[Killed] BlockStatement
src/lista_numerica.ts:12:27
     return this.numeros;
   }
 
-  getQuantidade(): number {
-    return this.numeros.length;
-  }
+  getQuantidade(): number {}
 
   getSoma(): number {
killedBy: ListaNumerica deve retornar a quantidade correta de elementos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] BlockStatement
src/lista_numerica.ts:16:21
     return this.numeros.length;
   }
 
-  getSoma(): number {
-    return this.numeros.reduce((acc, val) => acc + val, 0);
-  }
+  getSoma(): number {}
 
   estaDentroDoIntervalo(min: number, max: number): boolean {
killedBy: ListaNumerica deve retornar 0 como soma para uma lista vazia
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ArithmeticOperator
src/lista_numerica.ts:17:46
   }
 
   getSoma(): number {
-    return this.numeros.reduce((acc, val) => acc + val, 0);
+    return this.numeros.reduce((acc, val) => acc - val, 0);
   }
 
killedBy: ListaNumerica deve retornar a soma correta dos números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: -6

[Killed] ArrowFunction
src/lista_numerica.ts:17:32
   }
 
   getSoma(): number {
-    return this.numeros.reduce((acc, val) => acc + val, 0);
+    return this.numeros.reduce(() => undefined, 0);
   }
 
killedBy: ListaNumerica deve retornar a soma correta dos números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] BlockStatement
src/lista_numerica.ts:20:60
     return this.numeros.reduce((acc, val) => acc + val, 0);
   }
 
-  estaDentroDoIntervalo(min: number, max: number): boolean {
-    if (this.getQuantidade() === 0) return false;
-
-    return this.numeros.every(num => num >= min && num <= max);
-  }
+  estaDentroDoIntervalo(min: number, max: number): boolean {}
 
   validarIntervalos(qtdMin: number, qtdMax: number, valMin: number, valMax: number): boolean {
killedBy: ListaNumerica deve retornar true se todos os números estiverem dentro do intervalo com um único elemento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/lista_numerica.ts:21:9
   }
 
   estaDentroDoIntervalo(min: number, max: number): boolean {
-    if (this.getQuantidade() === 0) return false;
+    if (true) return false;
 
     return this.numeros.every(num => num >= min && num <= max);
killedBy: ListaNumerica deve retornar true se todos os números estiverem dentro do intervalo com um único elemento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lista_numerica.ts:21:9
   }
 
   estaDentroDoIntervalo(min: number, max: number): boolean {
-    if (this.getQuantidade() === 0) return false;
+    if (false) return false;
 
     return this.numeros.every(num => num >= min && num <= max);
killedBy: ListaNumerica deve retornar false se a lista estiver vazia
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/lista_numerica.ts:23:38
   estaDentroDoIntervalo(min: number, max: number): boolean {
     if (this.getQuantidade() === 0) return false;
 
-    return this.numeros.every(num => num >= min && num <= max);
+    return this.numeros.every(num => num > min && num <= max);
   }
 
killedBy: ListaNumerica deve retornar true se todos os números estiverem dentro do intervalo com um único elemento
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/lista_numerica.ts:23:38
   estaDentroDoIntervalo(min: number, max: number): boolean {
     if (this.getQuantidade() === 0) return false;
 
-    return this.numeros.every(num => num >= min && num <= max);
+    return this.numeros.every(num => num >= min || num <= max);
   }
 
killedBy: ListaNumerica deve retornar false se algum número estiver fora do intervalo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/lista_numerica.ts:26:94
     return this.numeros.every(num => num >= min && num <= max);
   }
 
-  validarIntervalos(qtdMin: number, qtdMax: number, valMin: number, valMax: number): boolean {
-    const qtd = this.getQuantidade();
-    if (qtd < qtdMin || qtd > qtdMax) {
-      return false;
-    }
-
-    return this.numeros.every(num => num >= valMin && num <= valMax);
-  }
+  validarIntervalos(qtdMin: number, qtdMax: number, valMin: number, valMax: number): boolean {}
 }
 
killedBy: ListaNumerica - validação de intervalo deve retornar true se quantidade e valores estiverem dentro do intervalo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] LogicalOperator
src/lista_numerica.ts:28:9
 
   validarIntervalos(qtdMin: number, qtdMax: number, valMin: number, valMax: number): boolean {
     const qtd = this.getQuantidade();
-    if (qtd < qtdMin || qtd > qtdMax) {
+    if (qtd < qtdMin && qtd > qtdMax) {
       return false;
     }
killedBy: ListaNumerica - validação de intervalo deve retornar false se a quantidade estiver fora do intervalo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/lista_numerica.ts:28:9
 
   validarIntervalos(qtdMin: number, qtdMax: number, valMin: number, valMax: number): boolean {
     const qtd = this.getQuantidade();
-    if (qtd < qtdMin || qtd > qtdMax) {
+    if (true) {
       return false;
     }
killedBy: ListaNumerica - validação de intervalo deve retornar true se quantidade e valores estiverem dentro do intervalo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/lista_numerica.ts:29:14
   validarIntervalos(qtdMin: number, qtdMax: number, valMin: number, valMax: number): boolean {
     const qtd = this.getQuantidade();
     if (qtd < qtdMin || qtd > qtdMax) {
-      return false;
+      return true;
     }
 
killedBy: ListaNumerica - validação de intervalo deve retornar false se a quantidade estiver fora do intervalo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/lista_numerica.ts:32:31
       return false;
     }
 
-    return this.numeros.every(num => num >= valMin && num <= valMax);
+    return this.numeros.every(() => undefined);
   }
 }
killedBy: ListaNumerica - validação de intervalo deve retornar true se quantidade e valores estiverem dentro do intervalo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lista_numerica.ts:32:38
       return false;
     }
 
-    return this.numeros.every(num => num >= valMin && num <= valMax);
+    return this.numeros.every(num => false);
   }
 }
killedBy: ListaNumerica - validação de intervalo deve retornar true se quantidade e valores estiverem dentro do intervalo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
